TestPlans/Car/Sure Thing! Max/xml/STM3_15102014_10.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:aggregateQuoteRequest xmlns:tns="http://schemas.cdlis.co.uk/aggregator/api/v3-8">
      <userid>CTM</userid>
      <password>tys82HS63BjS</password>
      <broker results="1">hastings-dir</broker>
      <broker results="1">hastings-ess</broker>
      <broker results="1">igi3</broker>
      <broker results="1">onequote</broker>
      <broker results="1">elite</broker>
      <broker results="1">virgin</broker>
      <broker results="1">esurebroker</broker>
      <broker results="1">sheilasbroker</broker>
      <broker results="1">hastings-prem</broker>
      <broker results="1">hastings-peoples</broker>
      <broker results="1">selecter-oyd</broker>
      <broker results="1">sagaselect</broker>
      <broker results="1">smartmiles</broker>
      <broker results="1">castlecover-ageas50</broker>
      <broker results="1">surething</broker>
      <broker results="1">igo4asp-santander</broker>
      <broker results="1">igo4asp-renault</broker>
      <broker results="1">insurewiser</broker>
      <broker results="1">coverbox</broker>
      <broker results="1">drivestyle</broker>
      <broker results="1">sheilaswheelsmd</broker>
      <broker results="1">SureThing-Max</broker>
      <policyType>PC</policyType>
      <returnNoQuotes>Y</returnNoQuotes>
      <store>true</store>
      <risk xsi:type="tns:privateCarRiskType">
        <policy>
          <inceptionDate>2014-10-24</inceptionDate>
          <frequency>A</frequency>
          <protectedBonus>N</protectedBonus>
          <cover>C</cover>
          <volXS>50</volXS>
          <restrict>ND</restrict>
          <previousInsurance>
            <expiryDate>2014-10-24</expiryDate>
            <yearsHeld>0</yearsHeld>
            <type>PC</type>
            <noClaimsBonusYears>9</noClaimsBonusYears>
            <ncbProtected>N</ncbProtected>
          </previousInsurance>
          <totalMileage>10000</totalMileage>
          <businessMileage>5000</businessMileage>
          <classOfUse>C1</classOfUse>
        </policy>
        <proposer driverId="1">
          <name>
            <title>Mrs</title>
            <forenames>Jacqui</forenames>
            <surname>Ten</surname>
          </name>
          <gender>F</gender>
          <dateOfBirth>1972-10-26</dateOfBirth>
          <maritalStatus>M</maritalStatus>
          <residentSince>1972-10-26</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>U</type>
            <occCode>U03</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <conviction convictionId="1">
            <code>SP10</code>
            <date>2012-01-01</date>
            <points>3</points>
            <disqualification>6</disqualification>
            <fine>150</fine>
          </conviction>
          <claim claimId="1">
            <code>C003</code>
            <date>2011-05-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>I</type>
            <date>2004-10-15</date>
          </licence>
          <vehicleUse>M</vehicleUse>
          <accessToOtherVehicles>CCSU</accessToOtherVehicles>
          <motoringOrg>INAM</motoringOrg>
          <smoker>Y</smoker>
          <address>
            <addressLine1>2 Duke of Edinburgh Way</addressLine1>
            <addressLine2>Malvern</addressLine2>
            <addressLine3></addressLine3>
            <addressLine4></addressLine4>
            <postCode>WR14 1AZ</postCode>
            <abodeType>H</abodeType>
          </address>
          <daytimeTelephone>01734320300</daytimeTelephone>
          <eveningTelephone>01734320300</eveningTelephone>
          <email>oliver.neal@emailreaction.org</email>
        </proposer>
        <driver driverId="2">
          <name>
            <title>Mrs</title>
            <forenames>Jessica</forenames>
            <surname>Ten</surname>
          </name>
          <gender>F</gender>
          <dateOfBirth>1985-03-13</dateOfBirth>
          <maritalStatus>S</maritalStatus>
          <residentSince>1985-03-13</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>FTE</type>
            <occCode>S50</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <claim claimId="2">
            <code>W001</code>
            <date>2011-05-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>N</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>E</type>
            <date>2010-10-15</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <relationshipToProposer>N</relationshipToProposer>
        </driver>
        <vehicle>
          <regNumber>WM11ENP</regNumber>
          <abiCode>16553803</abiCode>
          <yearOfManufacture>2011</yearOfManufacture>
          <whereKept>R</whereKept>
          <keeper>N</keeper>
          <owner>Leased</owner>
          <purchased>2012-09-01</purchased>
          <value>3000</value>
          <paid>3000</paid>
          <vehicleOthers>4</vehicleOthers>
          <LHD>N</LHD>
          <ABS>N</ABS>
          <seats>4</seats>
          <modifications>
            <modified>N</modified>
          </modifications>
          <immob>FACT</immob>
          <alarm>FACT</alarm>
          <tracker>NONE</tracker>
        </vehicle>
        <duqs>
          <question number="11">N</question>
          <question number="15">Y</question>
          <question number="190">2004</question>
          <question number="266">M</question>
          <question number="40">SPUB</question>
          <question number="579" />
          <question number="580"></question>
          <question number="578">N</question>
          <question number="282">I</question>
          <question number="527">Y</question>
          <question number="675">N</question>
          <question number="544">Y</question>
        </duqs>
      </risk>
      <brokerOptionalExtensions>
        <brokerOptionalExtension>
          <type>Premier Mandatory Bundle</type>
        </brokerOptionalExtension>
      </brokerOptionalExtensions>
    </tns:aggregateQuoteRequest>
  </soap:Body>
</soap:Envelope>